package cbj.lb;

import cbj.wc.DBUtil;

import java.util.List;

public class LbRenmingTest {

    public static void main(String[] args) throws Exception {
        doName();
       // doBankName();
    }

    private static void doBankName() throws Exception {
        String  tableName="business_manage";
        String coluName="opening_bank";
        String sql="select "+coluName+" from "+tableName;
        String whereSql=" where dept_id in ('d3aeaace1c054465af1a8217586bacd1'," +
                "'aa3bd51cd044429e8b0ea9316824b3e7'," +
                "'5e0ef1f0a0cf48b6974afb95c6905eb5'," +
                "'a1acadbe81d14345a86d7875d4c2df35'," +
                "'4a0176948a6f490a8192b09610fca886'," +
                "'cca7d711eda04822a21719f697dcf5f6'," +
                "'0df7c21c02d54d69951e439e71b0f846'," +
                "'fc88af1f5c5a47e3bf216594352bdd74'," +
                "'24ce8860624243238ce502e30eb9cac9'," +
                "'d15b8fd50913401ea869a1660bf30b22'," +
                "'f8d403a17e1f42cfb0bf9093362422c2'," +
                "'1757ceb78892445cbe3e10350a9e1258') ";
        sql=sql+whereSql;
        List<String> results = DBUtil.select(sql,coluName);
        System.out.println("==");
        for (String result : results) {
            if( result == null || result.isEmpty()||result.equals("/")){
                continue;
            }
            System.out.println("update "+tableName +" set " +coluName +" = '"+getBankName(result)+"' where "+ coluName +"='"+result+"';");
            getName();
        }
    }


    private static String getBankName(String backName){
        if(backName.contains("农业")){
            return "中国农业银行";
        }
        if(backName.contains("工商")){
            return "中国工商银行";
        }
        if(backName.contains("农村")){
            return "农村商业银行";
        }
        if(backName.contains("建设")){
            return "中国建设银行";
        }

        if(backName.contains("招商")){
            return "中国招商银行";
        }

        if(backName.contains("邮政")){
            return "中国邮政银行";
        }

        if(backName.contains("贵州")){
            return "贵州银行";
        }

        if(backName.contains("贵阳")){
            return "贵阳银行";
        }
        return "中国银行";
    }
    private static void doName() throws Exception {
        String  tableName="warehouse_manage";
        String coluName="compactor";
        String sql="select  DISTINCT "+coluName+" from "+tableName;
        String whereSql=" where dept_id in ('d3aeaace1c054465af1a8217586bacd1'," +
                "'aa3bd51cd044429e8b0ea9316824b3e7'," +
                "'5e0ef1f0a0cf48b6974afb95c6905eb5'," +
                "'a1acadbe81d14345a86d7875d4c2df35'," +
                "'4a0176948a6f490a8192b09610fca886'," +
                "'cca7d711eda04822a21719f697dcf5f6'," +
                "'0df7c21c02d54d69951e439e71b0f846'," +
                "'fc88af1f5c5a47e3bf216594352bdd74'," +
                "'24ce8860624243238ce502e30eb9cac9'," +
                "'d15b8fd50913401ea869a1660bf30b22'," +
                "'f8d403a17e1f42cfb0bf9093362422c2'," +
                "'1757ceb78892445cbe3e10350a9e1258') ";
        sql=sql+whereSql;
        List<String> results = DBUtil.select(sql,coluName);
        System.out.println("==");
        for (String result : results) {
            if(result == null || result.isEmpty()||result.equals("/")){
                continue;
            }
            System.out.println("update "+tableName +" set " +coluName +" = '"+getName()+"' where "+ coluName +"='"+result+"';");
            getName();
        }
    }


    private static  String getName(){
        int index= (int) (Math.random()*1000);
        return getNames()[index];
    }

    private static String[] getNames(){
      return new String[]{"朱劲", "小鲁","小鲁","卫寒", "华浩波", "孙俊晖", "华晨濡", "苏涵煦", "喻昂雄", "韩康", "姜景天", "韩勋", "施德昌", "周帅", "陶岩", "水哲", "孙昊明", "方禹", "施旭尧", "范振海", "许浩然", "华健", "冯运诚", "陈曜栋", "周晨", "苗豪", "凤寿", "金光", "姜昆明", "窦鸿卓", "柏高", "邹昆锐", "云文景", "章海阳", "邹辉", "马鸿畅", "金鸿博", "冯梁", "喻鸿德", "华昌勋", "曹尧", "谢钟", "赵鸿羲", "俞德运", "云勇", "冯运珧", "魏骞", "冯鹤", "花俊晖", "曹星睿", "鲁栋", "陈浩皛", "尤弘", "方冰", "柏越泽", "严明宇", "潘振荣", "孔运珧", "褚浩然", "陶鸿波", "邹昊宇", "吕昌勋", "章俊晖", "曹子昂", "范新曦", "张星泽", "方豪", "喻平", "水景天", "陈俊晖", "尤昂雄", "褚运骏", "陈林", "冯浩气", "苗寒", "邹清", "戚鸿云", "云昆峰", "华铭晨", "施涵衍", "葛高", "任辰良", "华运珹", "邹曜曦", "邹昊明", "张然", "杨超", "施宁", "朱飞昂", "陶元", "范鸿福", "吕瑞渊", "李鸿骞", "冯德昌", "王晨朗", "彭宣", "谢亮", "韦庆", "冯瀚昂", "吕鸿志", "蒋子昂", "金瀚玥", "钱乔", "孙宪", "冯泽雨", "吴运诚", "许景天", "鲁运鸿", "云斌", "邹昌燎", "尤河", "苏翔", "谢浩气", "葛新曦", "许莱", "彭然", "沈辉", "云吉", "姜晓", "周维运", "尤宁", "俞骞", "鲁凯", "苗聪", "潘宪", "窦江", "华昂然", "喻鑫鹏", "金浩博", "陶曜栋", "潘涵", "范浩气", "鲁曜瑞", "孙瀚彭", "马星爵", "陈昆峰", "马鸿云", "鲁滨", "吴浩歌", "凤星泽", "陈鹏煊", "沈乐", "施瑞", "冯敬曦", "周易", "华晨涛", "周轩昂", "韦鸿风", "尤江", "赵鹏池", "葛鑫", "孙桐", "苏允晨", "陶贤", "谢泽", "吕昆卉", "许曦哲", "苏刚", "邹聪", "冯运凯", "许鸿文", "冯昀", "方星爵", "周晨潍", "周耘志", "曹昂", "冯博耘", "褚运乾", "戚昌淼", "苗辰宇", "邹运升", "韦宪", "凤昌翰", "孙允晨", "柏昆皓", "凤泽洋", "吕靖", "陈梓", "任威", "沈星睿", "方越泽", "韩晟", "云昂然", "彭卓", "窦允晨", "范昭", "金鹏池", "凤子昂", "花昆卉", "施运晟", "苏锋", "葛振华", "苗浩思", "云昊伟", "华澄邈", "韦高", "许义", "许寿", "吴磬", "褚宣朗", "方鸿羲", "孙星然", "何禹", "陈德运", "韩辰铭", "陶铭晨", "姜鸿运", "方易", "金瑞", "蒋健", "杨寒", "喻振锐", "何运鹏", "章浩阔", "方辰阳", "秦雄", "袁高朗", "彭浦和", "俞虎", "朱鸿福", "方旭彬", "鲁星然", "范鸿哲", "何岩", "吴贵", "卫昭", "孙绍晖", "朱易", "奚运浩", "任鸿振", "张昊天", "邹鹏涛", "窦瀚玥", "花军", "王运恒", "喻海超", "水希", "秦昊伟", "冯滨", "葛鸿煊", "陈浩广", "彭景中", "云梁", "施智阳", "钱润", "周瑞渊", "花晖", "邹智宇", "姜浦和", "孙浩思", "魏培", "章运良", "柏振荣", "潘勇", "周晟", "邹昂然", "沈浩广", "赵昊然", "李鸿振", "昌曜栋", "冯河", "李振凯", "俞宪", "许海阳", "戚昀", "鲁昌勋", "苗昊东", "陶鑫", "柏鸿骞", "孙星腾", "范耘豪", "柏浩然", "潘辰韦", "韩星然", "卫坤", "潘起运", "施鸿文", "苏昆峰", "陈俊", "蒋旭鹏", "谢旭", "孙鸿熙", "吴浩慨", "华海逸", "任林", "喻浩皛", "俞嘉澍", "柳海逸", "陶丰", "苗雨", "戚锋", "谢运莱", "葛平", "朱宏", "尤飞", "秦飞", "凤博耘", "蒋昂雄", "苗梁", "蒋伦", "葛鸿志", "彭鑫", "施振华", "郎辰", "苗河", "柏寿", "何昂然", "姜起运", "孔德运", "韦辰龙", "水鸿畅", "云涵衍", "褚昊明", "孙星爵", "任浩思", "马飞", "孙景中", "潘允晨", "赵鑫鹏", "孔鹏池", "华敬", "方高旻", "方吉", "蒋鸿才", "任阳", "潘德运", "严昊苍", "吴奕", "华华晖", "王耀", "朱心", "钱风", "花贵", "魏昊天", "范吉星", "姜起", "周旭炎", "陈仁", "葛磬", "朱起", "苗起运", "昌奕", "施豹", "华彦", "戚瀚文", "冯振平", "沈威", "杨炜", "李星鹏", "陶轩", "姜昕", "彭耘涛", "孔耘志", "任昊天", "严运良", "昌博耘", "冯民", "王智杰", "任祺", "凤莱", "奚朝", "韩鸿才", "柏昌燎", "邹希", "施运升", "章岩", "何昆锐", "苗景行", "华运诚", "韦昱", "马良", "姜耀", "柏鹏", "彭耀", "周鸿祯", "马岩", "施河", "郑星泽", "葛文景", "彭鸿博", "钱旭彬", "陈鸿禧", "韩宽", "华朝", "沈鹏涛", "柏卓", "孙旭", "王炎", "柳勋", "周运良", "金旭", "郑岩", "钱浩皛", "金海阳", "韦震博", "昌强", "王铭晨", "孔悦", "谢运乾", "吴浩邈", "花晨轩", "郑高朗", "喻哲瀚", "卫寿", "赵运恒", "吴运晟", "赵昆皓", "韩震轩", "彭宏", "陈耘志", "邹鸿福", "杨昌燎", "周曦", "金运浩", "吴莱", "柳昕", "范瑞", "施曦哲", "卫鸿羲", "钱运恒", "范昌茂", "李海昌", "赵辉", "金威", "郎轩昂", "云磊", "吴昆鹏", "云曦之", "朱昂杰", "张祥", "杨鹏涛", "花辰锟", "沈晨朗", "沈峰", "葛景天", "周海昌", "施昆琦", "潘昆峰", "金运骏", "凤晗日", "戚佑运", "褚高旻", "苏鸿熙", "苏瑞", "魏昊硕", "苗昆纶", "昌辰良", "姜瀚钰", "韩晓", "施虎", "韩昂雄", "戚越泽", "袁昆卉", "蒋昊磊", "朱莱", "范鸿云", "郑昆皓", "郎涵亮", "吴军", "范弘", "吕鸿远", "朱泰", "苏辰宇", "水运凡", "昌东", "葛元", "俞寿", "马鸿德", "水智杰", "苏昆谊", "赵景浩", "郎铭", "何昱", "曹元", "谢涵衍", "钱丰", "严昂", "冯风", "苏昌黎", "尤辉", "韩昆鹏", "方劲", "蒋旭炎", "孔光", "凤昱", "邹旭", "尤清", "范德明", "窦鸿志", "钱曜坤", "凤涵衍", "钱云天", "尤建", "郑贵", "窦明", "韦胤运", "喻晗昱", "曹宏", "谢河", "谢澄邈", "彭虎", "鲁鹏煊", "喻震博", "彭文", "卫乔", "柳宁", "郑凡", "朱辰龙", "吴昌燎", "赵运乾", "姜钧", "李运骏", "郑恒", "窦晖", "戚信", "云鸿光", "潘鑫鹏", "吕昂然", "吕昊明", "郎起", "姜昂", "褚滨", "金洋", "曹运骏", "褚聪", "水宇", "奚宁", "云昆锐", "奚振凯", "韦德明", "袁翔", "水凡", "曹龙", "窦炎", "苏浦泽", "窦新曦", "章曜灿", "尤星鹏", "喻昭", "喻悦", "章祺", "华涵煦", "李军", "水昊伟", "尤伦", "俞梓", "云光济", "窦景天", "吴超", "沈昂熙", "戚烈", "孔进", "沈鑫", "朱运珹", "潘伟", "魏皓", "袁凌", "窦滨", "卫炎", "奚运晟", "昌鸿晖", "蒋阳", "潘曦之", "卫辉", "陈振博", "郑华", "奚新曦", "吴星睿", "窦俊", "魏希", "张德运", "李彦", "魏昆明", "郎浩慨", "鲁宁", "潘运诚", "陶辰宇", "昌寿", "章风", "谢鸿煊", "朱乔", "吕军", "孙浩轩", "鲁浩皛", "吕晓", "周星爵", "陈鸿飞", "柏梓", "施学智", "袁金鹏", "严轩昂", "沈昂杰", "华文景", "施贵", "蒋楷", "陶昊伟", "苏时", "柳昭", "孙运华", "潘昌盛", "鲁俊", "任飞昂", "俞昭", "钱曦之", "韩运发", "魏辰钊", "曹云", "孔昊然", "范鸿朗", "昌浩初", "沈皓", "章浩然", "吕运华", "许运恒", "谢浩轩", "水勋", "柏昕", "邹星爵", "潘广", "水昌黎", "苏坤", "窦卓", "鲁耘涛", "曹曜曦", "潘振平", "尤轩昂", "范曜灿", "孙耘豪", "钱晨潍", "喻海昌", "何君", "冯运珹", "俞元", "周博耘", "何欣", "谢锋", "魏昌燎", "任吉", "谢飞", "昌德曜", "施勇", "范鹏池", "彭民", "柏鸿风", "韩玄", "郎瑞", "金昆雄", "任华", "杨德泽", "谢鸿禧", "潘禹", "吴昊宇", "韩维运", "云智伟", "孔曜曦", "冯昊苍", "施梁", "钱劲", "范浩然", "窦宪", "戚昱", "苗彦", "邹浩轩", "苗辰韦", "褚瀚文", "杨海阳", "杨杰", "范鹏煊", "任宪", "孙昆谊", "卫华晖", "柏昂", "秦梁", "苗寿", "秦浦和", "张梁", "吴昊嘉", "袁朋", "何钧", "郎瀚昂", "郑航", "苗海荣", "韦海", "谢运浩", "尤鸿熙", "谢振宇", "姜运恒", "姜德泽", "魏吉星", "何敬", "曹玄", "云纬", "花卓", "钱运凯", "韦昕", "金博耘", "马浩广", "蒋威", "昌瀚", "孙炫明", "郎智晖", "钱民", "章文", "喻辰龙", "彭昆纶", "邹昂", "蒋昂然", "袁轩", "马昂", "许清", "郑辰铭", "奚运骏", "苗鑫", "何莱", "鲁博", "陈昆纶", "云昊嘉", "许昆锐", "曹曦哲", "花鹏", "陶鸿祯", "邹斌", "秦亮", "严鸿云", "袁宁", "褚锋", "韩纬", "孙炎", "奚旭彬", "韦振宇", "周映", "秦德明", "孙钟", "何昂雄", "严景中", "姜河", "许豹", "方凡", "卫星腾", "施浩宕", "吕贵", "周振锐", "王庆", "俞昊硕", "水君", "章欣", "吕运诚", "韦浩博", "蒋映", "韩智晖", "严鸿志", "方浦泽", "昌昌淼", "马振国", "袁良", "王斌", "方曦之", "施星睿", "曹贵", "孔旭炎", "华昆皓", "马丰", "范昌淼", "袁曜灿", "施晋鹏", "葛尧", "潘阔", "孔浩博", "俞曜文", "严朝", "冯运鹏", "沈新曦", "曹广", "韦景浩", "鲁景天", "秦岩", "孙阔", "章越泽", "金振锐", "施宏", "陶星", "杨昊磊", "朱宣朗", "窦昊明", "钱浩言", "苗运恒", "许浩波", "章景浩", "潘天", "严尧", "吴嘉澍", "魏鸿才", "彭辰龙", "邹文景", "鲁浩思", "陈澄邈", "施鸿祯", "朱永昌", "邹锋", "赵波", "卫纬", "吴明宇", "张烈", "郎瀚", "范勋", "苗鸿飞", "周鸿风", "凤昂杰", "周辰阳", "何宏", "鲁曦晨", "苏磬", "鲁渊", "蒋时", "周德明", "喻良", "章朋", "潘晨涛", "韦玄", "孔涛", "施华晖", "喻祺", "邹云", "施振海", "袁然", "许鸿禧", "邹昊磊", "李运发", "奚海逸", "孙运恒", "郑昊宇", "金庆", "沈振凯", "魏平", "何澄邈", "苗智伟", "戚涵衍", "水瀚彭", "陈鹏涛", "戚辰宇", "华鸿信", "柏曦晨", "钱浩", "韦昊东", "孔振荣", "朱敬", "喻晨濡", "凤瀚昂", "云耘涛", "何曜曦", "韩建", "陶昊嘉", "曹振华", "苏博耘", "曹谦", "冯文景", "尤德曜", "章光", "潘建", "朱烈", "王鸿", "尤智杰", "葛源", "窦朝", "邹逸", "何海逸", "章豹", "袁运浩", "昌宇", "王钧", "秦志", "卫雄", "钱祺", "朱祥", "杨高旻", "华劲", "柳伟", "花威", "李鸿", "邹丰", "杨曜曦", "彭希", "方威", "周曜灿", "王治汇", "章昂杰", "卫昊硕", "孔翔", "严运凡", "云飞", "俞昱", "金越泽", "云瀚玥", "戚阔", "苗炫明", "邹昊然", "戚永昌", "杨立", "谢昆明", "昌寒", "方允晨", "喻震轩", "金宪", "沈运盛", "卫亮", "凤庆", "许昌淼", "卫光济", "韩曜栋", "云曜坤", "吴越泽", "孙卓", "郑宇", "俞运发", "周磬", "施浩慨", "袁超", "赵晗日", "方晨潍", "沈鑫鹏", "曹海荣", "华威", "朱楷", "郑平", "吴鸿煊", "云涵煦", "苏林", "范哲", "郎龙", "彭鹤", "俞炎", "花瑞渊", "秦海逸", "苏耀", "陶海", "吕俊晖", "鲁昂然", "许星泽", "孙振荣", "姜运凯", "葛高朗", "冯昌", "魏晨轩", "任聪", "尤祺", "谢鑫鹏", "姜栋", "郑鑫", "马钟", "施健", "葛培", "郑进", "云曜瑞", "苏瀚文", "苏宁", "蒋运骏", "花家", "杨阳", "苗宁", "昌振博", "吕景平", "王昊然", "孔彭泽", "潘智宇", "李鹤", "姜烨", "凤振翱", "柳鸿志", "周运珹", "戚运凡", "孙星鹏", "戚浩", "许哲瀚", "华乐", "喻辉", "王昊嘉", "严旭", "陶浩思", "范昂雄", "张运凡", "金鸿宝", "昌景逸", "马浩思", "昌鸿文", "昌睿", "杨天", "韦然", "吕坤", "褚刚", "奚鸿朗", "柏志", "卫炫明", "曹磬", "王奕", "沈凡", "花文昂", "杨渊", "戚玮", "孔祥", "魏德曜", "秦子昂", "许博"};
    }
}
